package com.example.emc2.ui.home;

import android.view.View;

import androidx.lifecycle.LiveData;
import androidx.lifecycle.MutableLiveData;
import androidx.lifecycle.ViewModel;

import java.util.HashMap;

public class HomeViewModel extends ViewModel {
    private static final HashMap<Integer, String> tasks;

    static {
        tasks = new HashMap<>();
        tasks.put(0, "Весёлая задача: \n Расскажу я вам, дружочки, \n Как вышащивать грибочки: \n Нужно в поле утром рано \n Cдвинуть два куска урана... \n \n Вопрос: Какова должна быть общая масска кусков крана, чтобы произошел ядерный взрыв?");
        tasks.put(1, "Автомобиль проехал по шоссе расстояние 140 км за время 2 часа, затем автомобиль двигался по бездорожью и за время 3 часа он преодолел расстояние 70 км. Найти среднюю скорость на всем пути. Дать ответ в км/ч");
        tasks.put(2, "Поезд проехал первую половину пути со скоростью 80 км/ч, а вторую половину пути со скоростью 90 км/ч. Найти среднюю скорость поезда на всем пути.");
        tasks.put(3, "Мотоциклист ехал первую половину пути по скоростной автомагистрали со скоростью 120 км/ч, а вторую половину пути по проселочной дороге со скоростью 30 км/ч. Найти среднюю скорость мотоциклиста на всем пути.");
        tasks.put(4, "Половину расстояния турист летел на самолете со скоростью 700 км/ч, а потом сразу пересел на поезд и ехал на поезде со скоростью 100 км/ч. Найти среднюю скорость туриста на всем пути. Временем, затраченным на пересадку пренебречь.");
        tasks.put(5, "Третью часть расстояния до университета студент шел пешком со скоростью 7 км/ч, а остальное расстояние ехал на автобусе со скоростью 50 км/ч. Найти среднюю скорость студента на всем пути.");
        tasks.put(6, "Две трети пути катер двигался со скоростью 70 км/ч, а остальное расстояние он шел по мелководью со скоростью 6 км/ч. Найди среднюю скорость катера на всем пути.");
        tasks.put(7, "Третью часть пути вертолет летел со скоростью 384 км/ч,потом испортилась погода: пошел дождь, начался сильный ветер и еще треть пути он летел со скоростью 80 км/ч. Далее началась горная местность и остаток пути он летел со скоростью 20 км/ч. Найти среднюю скорость вертолета на всем пути");
        tasks.put(8, "Одну треть пути велосипедист ехал по полю со скоростью 5 км/ч, потом он выехал на асфальтированную дорогу и еще треть пути он ехал со скоростью 20 км/ч, потом он немного устал крутить педали и оставшееся расстояние он ехал со скоростью 12 км/ч. Найти среднюю скорость велосипедиста на всем пути.");
        tasks.put(9, "Средняя скорость велосипедиста на всем пути равна 40 км/ч. Первую половину пути он ехал со скоростью 60 км/ч. С какой скоростью велосипедист проехал остаток пути?");
        tasks.put(10, "Поезд прошел 25 км за 35 мин, причем первые 10 км он прошел в течение 18 мин, вторые 10 км в течение 12 мин, а последние 5 км за 5 мин. Определите среднюю скорость поезда на каждом участке и на всем пути.");

    }

    private final MutableLiveData<String> mText;
    int count;

    public void onButtonClick(View view) {
        for (int i = 1; i <= 10; i++) {
            count++;
        }
    }

    public HomeViewModel() {
        mText = new MutableLiveData<>();
        mText.setValue(tasks.get(0));
        tasks.remove(0);
    }

    public LiveData<String> getText() {
        return mText;
    }

    public void onPressBt() {
        boolean flag = false;
        while (!flag && (tasks.size() > 0)) {
            int id = (int) (Math.random() * 10 + 1);
            if (tasks.containsKey(id)) {
                mText.setValue(tasks.get(id));
                tasks.remove(id);
                flag = true;
            }
        }
    }
}